evaluation_set =  [
  {
      "text": "Netflix підписав угоду на трансляцію фільмів Sony Pictures після їхнього виходу у прокат. Зазначається, що найважливішим моментом в угоді на суму понад $7 мільярдів є закордонна частина. Фільми Sony більше не розподілятимуться між кількома платформами в межах закордонного вікна Pay-1, а спочатку будуть ексклюзивно виходити саме на Netflix після їхнього прокату.",
      "expected": {
         "company": "Sony Pictures",
         "event_type": "partnership",
         "amount": 7000000000,
         "currency": "USD"
      }
  },
  {
      "text": "Netflix домовилася про придбання студій та стрімінгового бізнесу Warner Bros. Discovery за $72 млрд – одного із найцінніших активів Голлівуду. Про це оголошено у пятницу, 5 грудня 2025 року. Угода може суттєво переформатувати глобальний медіаринок та викликати жорстку антимонопольну реакцію.",
      "expected": {
         "company": "Netflix",
         "event_type": "acquisition",
         "amount": 72000000000,
         "currency": "USD",
         "date": "2025-12-05"
      }
  },
  {
      "text": "Американська корпорація Google інвестує 5,5 мільярда євро у Німеччину протягом наступних чотирьох років. Це найбільша інвестиція компанії у ФРН на сьогодні. Інвестиція дозволить забезпечити у ФРН близько дев'яти тисяч робочих місць щорічно. Крім того, компанія Google офіційно оголосила про мету мінімізувати вплив своїх хмарних сервісів на клімат і довкілля в довгостроковій перспективі.",
      "expected": {
         "company": "Google",
         "event_type": "investment",
         "amount": 5500000000,
         "currency": "EUR",
         "location": "Німеччина"
      }
  },
  {
      "text": "17 березня 2026 року Apple представила iPhone 17e. Він замінює 16e і тепер пропонує вдвічі більше пам’яті, швидшу роботу і підтримку MagSafe. Крім чорного та білого, з’явився новий ніжно-рожевий колір.",
      "expected": {
         "company": "Apple",
         "event_type": "launch",
         "date": "2026-03-17"
      }
  },
  {
      "text": "В Ужгороді відкрили ювілейну виставку до 95-річчя Володимира Микити. Як розповів на відкритті виставки голова Закарпатської організації Національної спілки художників України, народний художник України Борис Кузьма - Володимир Микита був містком між основоположниками Закарпатської художньої школи та спадкоємцями.",
      "expected": {
         "company": "Закарпатська організація Національної спілки художників України",
         "event_type": "other",
         "location": "Ужгород"
      }
  },
  {
      "text": "Microsoft та OpenAI оголосили про розширення партнерства з багаторічними багатомільярдними інвестиціями, щоб швидше реалізовувати прориви в галузі штучного інтелекту (ІІ), йдеться у заяві OpenAI. Партнери повідомили, що хочуть поділитися перевагами з усім світом: розробники та організації матимуть доступ до найкращих інструментів через Azure, щоб допомогти створювати та запускати свої програми.",
      "expected": {
         "company": "Microsoft",
         "event_type": "partnership"
      }
  },
  {
      "text": "Україна запровадила санкції проти 91 морського судна російського тіньового флоту. Зазначається, що ці судна використовувалися для транспортування нафти й нафтопродуктів із російських портів до третіх країн.",
      "expected": {
         "company": "Україна",
         "event_type": "sanctions"
      }
  },
  {
      "text": "Amazon інвестує додаткові $5 млрд в Anthropic, що зміцнює партнерство в умовах посилення конкуренції у сфері штучного інтелекту. Угода також підкреслює зростаючу потребу Anthropic у обчислювальних потужностях для розвитку нових версій Claude. Як і OpenAI, компанія укладає угоди для доступу до чипів і хмарних ресурсів. Минулого тижня Anthropic оголосила про співпрацю з Broadcom для постачання чипів на базі тензорних процесорів Google — конкурента Amazon Trainium.",
      "expected": {
         "company": "Amazon",
         "event_type": "investment",
         "amount": 5000000000,
         "currency": "USD"
      }
  },
  {
      "text": "Meta Platforms представила у США оновленого помічника Meta AI, створеного на базі її великої мовної моделі Llama 3, йдеться у повідомленні Meta. У такий спосіб компанія Марка Цукерберга намагається наздогнати лідера ринку – OpenAI. Наразі будуть доступні дві версії – Llama 3 8B та Llama 3 70B, які містять 8 млрд і 70 млрд параметрів відповідно. Моделі будуть інтегровані у віртуальний помічник Meta AI, який було презентовано у вересні минулого року.",
      "expected": {
         "company": "Meta",
         "event_type": "launch",
         "location": "США"
      }
  },
  {
      "text": "Європарламент схвалив резолюцію про стратегічну оборону ЄС та партнерства у сфері безпеки, у якій Україну назвали пріоритетним стратегічним партнером і запропонували формалізувати співпрацю з нею у сфері безпеки та оборони.",
      "expected": {
         "company": "Європарламент",
         "event_type": "other",
         "location": "Україна"
      }
  },
  {
      "text": "Із початку повномасштабної війни МВФ надав Україні понад $12,4 мільярда - Шмигаль. Прем’єр-міністр України Денис Шмигаль обговорив із головою Європейського департаменту МВФ Альфредом Каммером деталі подальшої співпраці.",
      "expected": {
         "company": "МВФ",
         "event_type": "investment",
         "amount": 12400000000,
         "currency": "USD"
      }
  },
  {
      "text": "ООН разом із партнерами оголосила масштабний План гуманітарних потреб та реагування для України на 2026 рік, спрямований на допомогу найбільш уразливим верствам населення, які постраждали від повномасштабної війни.",
      "expected": {
         "company": "ООН",
         "event_type": "other",
         "location": "Україна"
      }
  },
  {
      "text": "Студія Warner Bros інвестує 1,25 млрд доларів у будівництво повністю функціонального «міні-міста», яке стане декораціями до нового серіалу про Гаррі Поттера. Творці серіалу планують побудувати повноцінне містечко Літтл-Уінгінг, з усім необхідним для організації виробництва - новими дорогами, багатоповерховими парковками, павільйонами для зйомок та безліччю допоміжних об'єктів.",
      "expected": {
         "company": "Warner Bros",
         "event_type": "investment",
         "amount": 1250000000,
         "currency": "USD"
      }
  },
  {
      "text": "Як повідомив CNN, фільм не мав успіху в жодному американському місті в день прем\'єри. Деякі кінотеатри були майже порожні..",
      "expected": {
         "company": "CNN",
         "event_type": "other"
      }
  },
  {
      "text": "Компанія SpaceX запустила 24 супутники Starlink з космічної бази Ванденберг у Каліфорнії. Їх на орбіту доставила ракета-носій Falcon 9, це був її 22-й політ. Після розділення один зі ступенів ракети приземлився на безпілотник Of Course I Still Love You у Тихому океані. Супутники Starlink запускають на орбіту у межах створення глобальної космічної мережі для роботи високошвидкісного супутникового інтернету у будь-якій точці планети.",
      "expected": {
         "company": "SpaceX",
         "event_type": "launch",
         "location": "Каліфорнія"
      }
  },
  {
      "text": "Європарламент схвалив надання Україні кредиту на €90 мільярдів. Відповідне рішення підтримали 458 депутатів, 140 були ""проти"" (44 - утрималися). З цієї суми 30 мільярдів євро буде виділено на макрофінансову допомогу або бюджетну підтримку, що надаватиметься через Механізм ЄС для України. 60 млрд євро буде виділено на зміцнення оборонного потенціалу України та підтримку закупівель військового обладнання. Якщо певні оборонні матеріали не будуть негайно доступні з європейських країн, то для їх постачання з ""третіх"" держав буде застосовано низку цільових відступів.",
      "expected": {
         "company": "Європарламент",
         "event_type": "investment",
         "amount": 90000000000,
         "currency": "EUR",
         "location": "Україна"
      }
  }
]