evaluation_set = [
  {
    "id": 1, "text": "Із такою заявою Рютте виступив на пресконференції після зустрічі міністрів оборони НАТО в Брюсселі.",
    "expected_entities": [("Рютте", "PERS"), ("НАТО", "ORG"), ("Брюсселі", "LOC")],
    "comment": "приклад PERS + ORG + DATE"
  },
  {
    "id": 2, "text": "5 грудня Netflix та Warner Bros Discovery оголосили про угоду на суму 82.7 мільярда доларів щодо придбання кіно- й телевізійної студій та інших активів.",
    "expected_entities": [("5 грудня", "DATE"), ("Netflix", "ORG"), ("Warner Bros Discovery", "ORG"), ("82.7 мільярда доларі", "MONEY")],
    "comment": "приклад DATE + ORG + MONEY"
  },
  {
    "id": 3, "text": "У Києві 20 січня презентують книгу про роботу української воєнної розвідки.",
    "expected_entities": [("Києві", "LOC"), ("20 січня", "DATE")],
    "comment": "приклад LOC + DATE"
  },
  {
    "id": 4,"text": "Український плеймейкер Максим Шульга підписав з клубом двосторонній контракті.",
    "expected_entities": [("Максим Шульга", "PERS")],
    "comment": "приклад PERS"
  },
  {
    "id": 5, "text": "БЕБ викрило масштабну контрабанду хутра на понад 11 мільйонів гривень.",
    "expected_entities": [("БЕБ", "ORG"), ("11 мільйонів гривень", "MONEY")],
    "comment": "приклад ORG + MONEY"
  },
  {
    "id": 6, "text": "Золото знову перевищило $5 тисяч за унцію.",
    "expected_entities": [("$5 тисяч", "MONEY")],
    "comment": "приклад MONEY"
  },
  {
    "id": 7, "text": "Фінал Нацвідбору Молдови відбудеться 17 січня 2026 року на Кишинів Арені.",
    "expected_entities": [("17 січня 2026 року", "DATE"), ("Молдови", "LOC")],
    "comment": "приклад DATE + LOC"
  },
  {
    "id": 8, "text": "Співкерівник Netflix прокоментував злиття з Warner Bros та участь у цьому Дональда Трампа.",
    "expected_entities": [("Дональда Трампа", "PERS"), ("Netflix", "ORG"), ("Warner Bros", "ORG")],
    "comment": "приклад PERS + ORG"
  },
  {
    "id": 9, "text": "Національний банк України прогнозує беземісійне фінансування дефіциту бюджету.",
    "expected_entities": [("Національний банк України", "ORG")],
    "comment": "приклад ORG (довгий span)"
  },
  {
    "id": 10, "text": "Дональд Трамп скасував додаткові мита для Індії, які запроваджував через імпорт російської нафти.",
    "expected_entities": [("Дональд Трамп", "PERS"), ("Індії", "LOC")],
    "comment": "приклад PERS + LOC"
  },
  {
    "id": 11, "text": "Європарламент схвалив надання Україні кредиту на €90 мільярдів.",
    "expected_entities": [("Європарламент", "ORG"), ("Україні", "LOC"), ("€90 мільярдів", "MONEY")],
    "comment": "приклад ORG + LOC + MONEY"
  },
  {
    "id": 12,"text": "Сума контракту становить 200 тис грн.",
    "expected_entities": [("200 тис грн", "MONEY")],
    "comment": "приклад MONEY"
  },
  {
    "id": 13, "text": "Столиця Латвії передасть Україні €100 тисяч на генератори.",
    "expected_entities": [("€100 тисяч", "MONEY"), ("Латвії", "LOC"), ("Україні", "LOC")],
    "comment": "приклад MONEY + LOC"
  },
  {
    "id": 14, "text": "Переговори відбулися 5 травня 2021 року у Берліні.",
    "expected_entities": [("5 травня 2021 року", "DATE"), ("Берліні", "LOC")],
    "comment": "приклад DATE + LOC"
  },
  {
    "id": 15, "text": "В Україні із 2022 року підключили 1,4 ГВт газової генерації.",
    "expected_entities": [("2022 року", "DATE"), ("Україні", "LOC")],
    "comment": "приклад DATE"
  },
  {
    "id": 16, "text": "Катерина Коцар не пройшла кваліфікацію у слоупстайлі.",
    "expected_entities": [("Катерина Коцар", "PERS")],
    "comment": "приклад PERS"
  },
  {
    "id": 17,"text": "Фільм став результатом угоди з AmazonMGM Studios на суму 40 мільйонів доларів.",
    "expected_entities": [("AmazonMGM Studios", "ORG"), ("40 мільйонів доларів", "MONEY")],
    "comment": "приклад ORG + MONEY"
  },
  {
    "id": 18, "text": "у вересні 2025 року Федеральна торгова комісія США (FTC) розпочала розслідування щодо техкомпаній Google та Amazon.",
    "expected_entities": [("вересні 2025 року", "DATE"), ("Федеральна торгова комісія США (FTC)", "ORG"), ("США", "LOC"), ("Google", "ORG"), ("Amazon", "ORG")],
    "comment": "приклад DATE + ORG + LOC"
  },
  {
    "id": 19, "text": "На Закарпатті розпочав роботу оновлений термінал «Євробрідж».",
    "expected_entities": [("Євробрідж", "ORG"), ("Закарпатті", "LOC")],
    "comment": "приклад ORG + LOC"
  },
  {
    "id": 20, "text": "Росія відповідальна за те, що відбувається в Україні з 2014 року.",
    "expected_entities": [("2014 року", "DATE"), ("Росія", "LOC"), ("Україні", "LOC")],
    "comment": "приклад DATE + LOC"
  },
  {
    "id": 21, "text": "Лоренс Фішберн разом із Скарлетт Йоганссон зіграють у «Екзорцисті».",
    "expected_entities": [("Лоренс Фішберн", "PERS"), ("Скарлетт Йоганссон", "PERS")],
    "comment": "приклад PERS"
  },
  {
    "id": 22, "text": "Засідання відбулося 8 серпня 2025 року.",
    "expected_entities": [("8 серпня 2025 року", "DATE")],
    "comment": "приклад DATE"
  },
  {
    "id": 23, "text": "Швеція оголосить третій пакет військової допомоги Україні.",
    "expected_entities": [("Швеція", "LOC"), ("Україні", "LOC")],
    "comment": "приклад LOC"
  },
  {
    "id": 24, "text": "ЮНІДО уклало грантові угоди з японськими компаніями для тестування технологій в Україні.",
    "expected_entities": [("ЮНІДО", "ORG"), ("Україні", "LOC")],
    "comment": "приклад ORG + LOC"
  },
  {
    "id": 25, "text": "Юлія Свириденко повідомила про ухвалення рішення перерозподілити 231 млн грн субвенції на завершення робіт з облаштування шкільних укриттів.",
    "expected_entities": [("Юлія Свириденко", "PERS"), ("231 млн грн", "MONEY")],
    "comment": "приклад PERS + MONEY"
  },
  {
    "id": 26, "text": "Рішення було ухвалене 30 вересня 2021 року.",
    "expected_entities": [("30 вересня 2021 року", "DATE")],
    "comment": "приклад DATE"
  }
]

